app/views/questions/_form.html.erb

    <%= form.label :test %><br>
    <%= form.collection_select :test_id, Test.all, :id, :title, prompt: true %>
---
SELECT "tests".* FROM "tests"