app/views/test_passages/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 2) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 2]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 2]]
---

        <% if @test_passage.current_question.answers.count.zero? %>