app/controllers/answers_controller.rb

INSERT INTO "answers" ("body", "correct", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "5"], ["correct", 0], ["question_id", 5], ["created_at", "2022-01-27 04:15:39.694066"], ["updated_at", "2022-01-27 04:15:39.694066"]]
---
  def create
    @answer = Answer.new(answer_params)

    if @answer.save

UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "Jaz"], ["updated_at", "2022-01-27 13:23:00.692409"], ["id", 3]]
---
  def update
    if @answer.update(answer_params)

DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 11]]
---
  def destroy
    @answer.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_question
      @question = Question.find(params[:question_id])