app/controllers/questions_controller.rb

INSERT INTO "questions" ("body", "test_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "YOU"], ["test_id", 1], ["created_at", "2022-01-25 15:18:32.392246"], ["updated_at", "2022-01-25 15:18:32.392246"]]
---
  def create
    @question = @test.questions.new(question_params)
    if @question.save

UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "YO"], ["updated_at", "2022-01-25 15:22:06.678034"], ["id", 4]]
---
  def update
    if @question.update(question_params)

SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_test
    @test = Test.find(params[:test_id])