app/controllers/test_passages_controller.rb

  def set_test_passage
    @test_passage = TestPassage.find(params[:id])
---
SELECT "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]