app/models/answer.rb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 4]]
---
  def validate_number_of_answers
    errors.add(:amount) if question.answers.count >= 4