app/models/test_passage.rb

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 2) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]
---
  def set_current_question
    if new_record? && test.present?
      self.current_question = test.questions.order(:id).first
    else
      current_question = nil if time_out?
      self.current_question = test.questions.order(:id)[current_question_index + 1]