app/models/test_passage.rb

  def number_of_questions
    test.questions.count
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 2]]

  def success_percents
    100 / test.questions.count * correct_questions
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 2]]

  def before_validation_set_first_question
    self.current_question = test.questions.first if test.present?
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]

  def next_question
   test.questions.order(:id).where('id > ?', current_question.id).first
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = ? AND (id > 2) ORDER BY "questions"."id" ASC LIMIT ?  [["test_id", 2], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]