app/views/tests/_form.html.erb

    <%= form.label :category_id %><br>
    <%= form.collection_select :category_id, Category.all, :id, :title, prompt: true %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC