app/views/tests/_test.html.erb

  <td class="text-left"><%= test.category.title%></td>
  <td><%= test.questions.size%></td>
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 1]]